/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   read_line.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tseo <tseo@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/07 12:19:36 by tseo              #+#    #+#             */
/*   Updated: 2021/03/07 13:19:54 by tseo             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../incs/minishell.h"

int		get_input_line(char **line)
{
	// char *tmp;

	get_next_line(STDIN_FILENO, line); // EOF 아닐 때까지 한 줄 읽기로 변환해야 한다
	return (1);
}
